### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-09T13:35:35.702+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:19",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:15" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:15/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
+       s3_object_version              = (known after apply)
        tags                           = {}
!       version                        = "15" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "15" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "bcc8e75a430901b875d5ca4979466d76" -> (known after apply)
!       id                     = "lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> (known after apply)
!       key                    = "lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "null" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3776229927608769814" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
!           "timestamp" = "1691588066364652000" -> "1691588816194458000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "5723590453356146528" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/c8691894c9b710a31288508581ef0c4448bcfde82cca668880de9330d60a99e1.zip" -> "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:19" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-09T13:35:23.520+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:19" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
!       s3_object_version           = "nJTI6eZj5kUFYs3pyHs13TBtDbUF1ioC" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "68RVSc7Nd/jyOy0L8piZ9B91P6EqNbVEY2psfzWeSCY=" -> (known after apply)
!       source_code_size            = 26187391 -> (known after apply)
!       version                     = "19" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "4be0034ddaa8b386a4235f362e35436b-5" -> (known after apply)
!       id                     = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> (known after apply)
!       key                    = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "nJTI6eZj5kUFYs3pyHs13TBtDbUF1ioC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4583255863025037396" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
!           "timestamp" = "1691588067831271000" -> "1691588817963255800"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7889016583144610246" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/84b65bba981e760d216705324994a97a890c78c7eec9af14d5e3035dc8e24dd8.zip" -> "builds/8500450bb1f0c089320727f6d20d0ffa53cc872a7dd21bc5b7661cb1828fa27c.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>